[{"classified_as": "enhancement", "text": "Steps to repro:\r\n\r\n1. Create receive-only folder\r\n2. Add some file, which is then displayed as a local change.\r\n3. Add an ignore pattern matching the added file.\r\n\r\nResult: Local state zero, global state still 1.\r\n\r\nExpected: Both 0."}, {"classified_as": "bug", "text": "subscribeNewHeads only works when the node runtime provides the session module. If this is not the case (when using Aura consensus for example) the method throws an error that api.query.session is undefined. "}, {"classified_as": "enhancement", "text": "Is there any way to change the content-type when using S3Adapter? Images are all being downloaded instead of being viewed.\n"}, {"classified_as": "bug", "text": "Create GET /debug endpoint which returns the below info.\r\n\r\n1. Server OS and version\r\n2. PHP version\r\n3. MySQL version\r\n4. PHP extension (pdo, mysql, curl, gd, fileinfo, libapache2-mod-php and mbstring)\r\n5. if applicable, mod_rewrite enable.\r\n5. Public directory permission\r\n6. Log directory permission\r\n7. /public/uploads directory permission\r\n8. API version\r\n9. APP version\r\n10. Max file upload size\r\n11. Browser OS (Either server will try to detect from header or App will add in additional of the server response)\r\n12. Cache driver, if Cache enable\r\n13. Storage driver\r\n14. Log path\r\n15. App environment "}, {"classified_as": "enhancement", "text": "The \"number of items to display\" option at the foot of the pop-up page is (thankfully!) persistent, but so is the page number.  When the pop-up page is closed _(either with the \"Close\" button or by clicking on originating page \"behind\" the pop-up page)_, the page number that was being displayed is also persistent, so that on re-opening the pop-up _(which always displays page 1 of the refreshed list)_, the page number displayed is wrong - should be 1, of course.\r\n\r\n**A very, VERY minor bug in a superb package!**\r\n\r\nMay I be a nuisance and - as it's related to the same part of SyncThing - mention a preference?   It would be good if the page selector could be at the top of the pop-up as well as it would save a lot of scrolling when 50 items are being displayed.\r\n\r\n\r\n### Version Information\r\n\r\nSyncthing Version: v1.3.4 (Linux 64-bit)\r\nOS Version: Windows 7 (for SyncThing monitoring)\r\nBrowser Version: Firefox 74 (64-bit)\r\n\r\n"}, {"classified_as": "enhancement", "text": "When trying to reset password on User who has empty email field, i.e. only has the email in username field, it throws error No user found with email\n### Steps to reproduce\n1. Register new user using an email and password. E.g. set user.Username = \"a@b.c\" - do not set email field.\n2. When registered, request password reset\n#### Expected Results\n\n\"This will attempt to match the given email with the user’s email or username field, and will send them a password reset email.\" as stated in [docs](http://parseplatform.github.io/docs/dotnet/guide/).\n#### Actual Outcome\n\nReturns error: No user found with email a@b.c\n"}, {"classified_as": "enhancement", "text": "I have everything setup correctly \"so I say\". \n\nAny ideas?\n"}, {"classified_as": "enhancement", "text": "Since the new upgrade check (#6385) we're getting a significant flood of upgrade requests. The problem is that some clients are stuck in restart loops, for various reasons, and hammer the upgrade server. We can of course offload this in various ways (CDNs and whatnot) but it still seems like an oversight that we should handle better...\r\n\r\nServer side rate limiting at the HTTPS level isn't enormously useful as the main cost is in the TLS handshake to begin with."}, {"classified_as": "enhancement", "text": "There should be a way to specify both API basePath and SwaggerResource basePath separately.\n\nWe should be able to have a RESTful resource at basePath: resource_v1/api\n...and SwaggerResources at basePath: resource_v1/api-docs\n\n...without getting in each others' way...\n\nThis allows for creating an api-docs.json file by hand which lies on a separate path from the RESTful resources that it describes.\n"}, {"classified_as": "enhancement", "text": "We send local discovery packets on all compatible local interfaces, and can receive announcements from the same device on multiple interfaces as well. However for each received response we construct an address list based on the addresses in that announcement packet plus and the apparent source address, and then set that as the cache entry for the device in question. This means that later announcements override earlier ones, and we'll only ever see the latest announced address (highest number interface, probably).\r\n\r\nWe should keep all received addresses, or keep a separate cache per source address, or something."}, {"classified_as": "enhancement", "text": "Since IE11 doesn't support startsWith function, we could add something like that to define it.\r\n\r\n\r\n\r\nif (!String.prototype.startsWith) {\r\n  String.prototype.startsWith = function(searchString, position) {\r\n    position = position || 0;\r\n    return this.indexOf(searchString, position) === position;\r\n  };\r\n}\r\n"}, {"classified_as": "enhancement", "text": "DefaultValue of parameters used to be filled in by default.\nRight now they are not anymore.\n\n(swagger 1.2)\n"}, {"classified_as": "enhancement", "text": "This project needs a robust testing framework\n"}, {"classified_as": "bug", "text": "When I go to database settings page in studio, my browser automatically fill fields \"username\" and \"password\". Maybe you can add attribute autocomplete=\"off\" in these fields?\n\n![2016-01-31 22 35 48](https://cloud.githubusercontent.com/assets/557190/12704394/1df1d3d4-c86b-11e5-9c47-39efc962d7dd.png)\n\nBrowser: Google Chrome, Mac OS.\n"}, {"classified_as": "enhancement", "text": "Since #6336 there's an issue where metadata gets doubled if a recalculation is deemed necessary. The reason is that we will have loaded the existing metadata, then do a recalc by adding all files without clearing it first."}, {"classified_as": "bug", "text": "I'm doing something relatively simple in the request interception:\r\n\r\njavascript\r\nconst headers = request.headers();\r\nconst modifiedHeaders = { ...headers, \"x-new-header\": \"true\" };\r\n\r\nrequest.continue({ headers: modifiedHeaders });\r\n\r\n\r\nHowever, later, when I receive the callback for the response, this header is missing from the associated request:\r\n\r\njavascript\r\nresponse.request().headers()[\"x-new-header\"] !== \"true\";\r\n\r\nI am trying to mark the request as modified so that later in the response I know this was one of my intercepted requests."}, {"classified_as": "enhancement", "text": "### Describe the bug you're encountering\r\n\r\nSee the title 😄 \r\n\r\n<img width=\"1066\" alt=\"image\" src=\"https://user-images.githubusercontent.com/680248/45240042-24645e80-b29c-11e8-9439-1e0ae8990e14.png\">\r\n\r\n\r\n### To reproduce...\r\n\r\nSteps to reproduce the behavior:\r\n1. Load any OAS3 definition with a Severs Object.\r\n\r\n### Expected behavior\r\n<!-- A clear and concise description of what you expected to happen. -->\r\n\r\nServers should be displayed inline, similar to Swagger 2.0 Schemes:\r\n\r\n<img width=\"1058\" alt=\"image\" src=\"https://user-images.githubusercontent.com/680248/45240071-3514d480-b29c-11e8-8f20-cef1d755ffeb.png\">\r\n\r\n\r\n### Additional context or thoughts\r\n<!-- Add any other context about the problem here. -->\r\n\r\nFiled on behalf of @ralphdoe."}, {"classified_as": "enhancement", "text": "In SwaggerUIBundle,validatorUrl set it to false will disable validation is right.\r\n\r\nversion:3.0.6\r\n\r\n"}, {"classified_as": "enhancement", "text": "This is causing some params to not be submitted through the UI\n"}, {"classified_as": "enhancement", "text": "Look into this plugin, per #147 \n"}, {"classified_as": "enhancement", "text": "I want to use a / character in the tag name when grouping resources but this breaks the shebang stuff.\n\nFor example if I have a tag named /login to group all resources related to login I get an url like: http://....../apidocs/#!//login/login_profile_get which does not automatically expand.\n"}, {"classified_as": "enhancement", "text": "Putting an email address in a query parameter field hits the host of the email address. To fix this I had to encode the components. I put my hack at the start of parseUri, but it should probably go somewhere else.\n\n javascript\nfunction parseUri (str) {\n  str = str.replace(/\\?(.*)/gi, function($0, $1) {\n    var parts = $1.split('='),\n      hasQuestion = $0.indexOf('?') === 0,\n      encoded = encodeURIComponent(parts[0]) + '=' + encodeURIComponent(parts[1]);\n\n    if (hasQuestion) {\n      encoded = '?' + encoded;\n    }\n    return encoded;\n  });\n\n"}, {"classified_as": "enhancement", "text": "Is it possible to modify the way to generate objectId for custom class instead of the auto generate 10 pseudo random 10 character string? Is it possible to have more than 10 characters objectId? thanks"}, {"classified_as": "enhancement", "text": "Hello,\r\n\r\nI just tried to set VALIDATOR_URL when running your container and it appears that docker-run.sh don't match your regex line 42 sed -i \"s|\\(url: url,.*\\).\r\n\r\nThere is a useless \"url\" string, a little fix : sed -i \"s|\\(url: .*,\\)\r\n\r\nRergards,\r\nRed"}]