[{"classified_as": "api", "text": "version: 12.9.0\r\ngcc: 8.2\r\n\r\nmessage:\r\n\r\n#\r\n# Fatal error in , line 0\r\n# Check failed: (isolate_->embedded_blob()) != nullptr.\r\n#\r\n#\r\n#\r\n#FailureMessage Object: 0x7fff837402c0  (core dumped)\r\n\r\n\r\n"}, {"classified_as": "api", "text": "\r\nHello,\r\n\r\nIs there a REST endpoint for resending verification of emails?  I don't see anything in the documentation.\r\n\r\nThanks."}, {"classified_as": "api", "text": "Hello , \n\nI have successfully migrate the database to mongodb and i uploaded parse server to google app engine , i tried to query a class called **Category**  \nit worked.However , when i try to do some Constrains like where equal to it didn't  work.\n\nthe rest api ,shows the same result with or without constrains\n\n![screen shot 2016-02-03 at 5 03 57 pm](https://cloud.githubusercontent.com/assets/5598959/12782991/3e3433d8-ca98-11e5-8c75-d47067cc77ad.png)\n\n![screen shot 2016-02-03 at 5 03 41 pm](https://cloud.githubusercontent.com/assets/5598959/12782993/46232f4a-ca98-11e5-8921-5922ae21ec0f.png)\n\nin addition i have tried the same thing in android sdks and it didn't work when i put constrains only it works without the constrains. \n"}, {"classified_as": "api", "text": "When launching the node.js REPL with the --trace-sync-io option, then typing sync fs statements, the repl prints one or two trace sync io statements for every key press following the opening ( ... See screenshot:\r\n\r\n![image](https://user-images.githubusercontent.com/439929/78677080-2806ff80-789c-11ea-8eb4-c31d0b4e5706.png)\r\n\r\n/cc @BridgeAR "}, {"classified_as": "api", "text": "@estrada9166 recently brought up that test/parallel/test-repl-save-load.js is not working as it should. It should fail as is it but the errors are swallowed due to calling complete.\r\n\r\nIt seems like the domain does not propagate the error properly and it's silently swallowed. Adding an error listener to the active domain in the complete function that throws the error fixes the problem but it causes some side effects in other cases. We should only add the listener to the domains that do not handle the error properly at the moment.\r\n\r\nPing @Trott since you fixed some of these cases before."}]